Revit 2027 API
BuiltInFailures.LooseDimensionFailures Class
 Failures about LooseDimension.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class LooseDimensionFailures
Public NotInheritable Class LooseDimensionFailures
public ref class LooseDimensionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LooseDimensionFailures = class end
The BuiltInFailures.LooseDimensionFailures type exposes the following members.
Properties
Name | Description
LooseCurtainWallData |  Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.
LooseDimensionsForCurtainWall |  Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.
LooseFaceSplitsForCurtainWall |  Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.
LooseInsertsForCurtainWall |  Switching element type to Curtain element. All inserts in the element will be deleted.
LooseWallsweepsForCurtainWall |  Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace